app/controllers/users_controller.rb

  def index
    # @users = User.all
	# @users = User.all.where("id != ?", current_user.id)
	@users = User.where.not(id: current_user.id)
---
SELECT "users".* FROM "users" WHERE (id != 6)

  def show
    @tweet = current_user.tweets.build if signed_in?
    @feed_items = @user.tweets.paginate(page: params[:page])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1  ORDER BY "tweets"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "picture", "slug", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update

		if params[:user][:picture]
			uploaded_io = params[:user][:picture]
			params[:user][:picture] = uploaded_io.original_filename
		end

		if @user.update(user_params) # check saved ?
---
UPDATE "users" SET "name" = $1, "email" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["name", "Test name1"], ["email", "test1@gmail.com"], ["password_digest", "$2a$10$1To8yFWvfBfBFzMfbdOttuugmngUE5spsMdNYqY08g4Ig2DDilX7m"], ["updated_at", "2016-06-10 05:16:43.067006"], ["id", 4]]

    def set_user
      @user = User.find_by!(slug: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."slug" = $1 LIMIT 1  [["slug", "shoeab"]]